from aiogram.utils.formatting import TextMention

from models.user import UserResponse
from datetime import datetime

### Кнопки меню

# Кнопки админов
btn_admins = '🔑 Админы' # callback_data=
about_users_bot = '👥 Пользователи' # callback_data=
btn_create_deep_link = '🔗 Создать диплинк подписки' # callback_data=

# Кнопки пользовательского меню
btn_buy = '💳 Купить' # callback_data='buy'
btn_my_key = '🔐 Мой ключ' # callback_data='my_key'
btn_help = '🆘 Помощь' # callback_data='help'
btn_back = '👈 Назад'

btn_trial_buy = '🔎 Пробный период' # callback_data='trial_bay'
btn_buy_one_month = '🟢 1 месяц'
btn_pay_with_card = '💳 Картой РФ'
btn_pay_with_stars = '⭐️ Звездами'
btn_get_qr_code = '🖼 Получить QR-код' # callback_data='get_qr_code'


# Кнопки меню помощи
btn_how_to_connect = '📖 Как подключиться' # callback_data='how_to_connect'
btn_support = '💬 Связаться с поддержкой' # callback_data='support'
btn_main_menu = '🏠 Главное меню' # callback_data='start'



### Текс сообщений ###

start_help_message = '''
🏢 <b>Управляющая компания «ЖКХ ВПН»</b> <i>(Жилищный Канал Хостинга)</i>

— Обеспечиваем <b>высокое давление</b> в ваших цифровых магистралях.
— Подключение любых бытовых устройств (iOS, Android, PC).

<i>Открыт к предложениям и пожеланиям! Если что-то не работает, что-то не получается, или нет нужной локации, пишите мне @foteleg_b. Постараюсь всё реализовать. Этим ВПН-ом я пользуюсь сам, так-что мне важен его перфоманс и обратная связь.</i>
'''

def trial_days_text(subscription_url):
    return f'''
🔎 <b>Пробный период</b>

Вы получили доступ к пробному периоду!

🔗 <b>Ссылка на подписку:</b>
<code>{subscription_url}</code>

📱 <b>Как использовать:</b>
1. Скопируйте ссылку выше
2. Откройте приложение VPN
3. Добавьте подписку по ссылке

⏰ Пробный период действует 3 деня.
'''


help_text = '''
🆘 В этом разделе доступно:

Настройка: Пошаговые гайды для быстрого запуска.

Решение проблем: Помощь, если возникли сложности с подключением.

По любым вопросам пишите мне @foteleg_b, открыт к общению и предложениям.
'''

help_manual_text = f'''
📖 <b>Как подключиться к VPN</b>

- Перейдите по ссылке подписки 
- На странице будут ссылки на приложене happ (app store, google play, windows)
- После установки приложения нажимаем на кнопку добавить подписку и она автоматически добавися в приложение happ 



<b>ДРУГИЕ СПОСОБЫ УСТАНОВКИ:</b>

📱 <b>Для Android | iOS:</b>

1. Скопируйте ссылку на подписку
2. Скачайте приложение любой подходящий клиент (happ, v2raytun, hiddify ...) 
3. Откройте и нажмите на "+" в правом верхнем углу
4. Выберите "Вставить из буфера обмена" или "QR-код"
5. Нажмите "Подключиться" 

<b>💻 Для Windows | macOS</b>
Можно скачать страницы на <a href="https://github.com/Happ-proxy"\>Github</a>

<b>📋 Реестр допущенного оборудования:)</b>
    • <b>Clash X</b> (macOS)
    • <b>v2raytun</b> (Android, Windows, Ios, macOs)
    • <b>v2rayN</b> (Windows)
    • <b>Hiddify</b> (Android, Windows, iOS, macOS, Linux)


💡 <i>Если возникли проблемы, пишите @foteleg_b</i>
'''

my_kyes_no_key = '❌ У вас нет ЖКХ ключа\n\n<i>Жилищный Канал Хостинга</i>'


def my_keys_stat_info(user_marz: UserResponse):
    # Форматируем статус
    status_emoji = {
        'active': '✅',
        'disabled': '❌',
        'limited': '⚠️',
        'expired': '⏰',
        'on_hold': '⏸️'
    }
    status_text = {
        'active': 'Активен',
        'disabled': 'Отключен',
        'limited': 'Ограничен',
        'expired': 'Истек',
        'on_hold': 'На паузе'
    }
    
    emoji = status_emoji.get(user_marz.status.value, '❓')
    status = status_text.get(user_marz.status.value, user_marz.status.value)
    
    # Форматируем трафик
    # used_gb = user_marz.used_traffic / (1024 ** 3)
    lifetime_used_gb = user_marz.lifetime_used_traffic / (1024 ** 3)
    
    # data_limit_text = 'Безлимит'
    # if user_marz.data_limit:
    #     data_limit_gb = user_marz.data_limit / (1024 ** 3)
    #     remaining_gb = (user_marz.data_limit - user_marz.used_traffic) / (1024 ** 3) if user_marz.data_limit else 0
    #     data_limit_text = f'{data_limit_gb:.2f} GB (осталось: {remaining_gb:.2f} GB)'
    
    # Форматируем дату истечения
    if user_marz.expire == 0:
        expire_text = '∞'
    elif user_marz.expire is not None:
        expire_date = datetime.fromtimestamp(user_marz.expire)
        expire_text = expire_date.strftime('%d.%m.%y | ') + f' ({(expire_date - datetime.now()).days} д.)'
    else: 
        expire_text = 'На паузе'
    
    text = (
        '<b>🧾 КВИТАНЦИЯ ПО ЛИЦЕВОМУ СЧЕТУ</b>\n\n'
        f'{emoji} <b>Статус:</b> {status}\n'
        f'📊 <b>Расход трафика: {lifetime_used_gb:.2f} GB</b>\n'
        f'📅 <b>Срок действия:</b> {expire_text}\n\n'
        f'🔗 <b>Ссылка на подписку:</b> {user_marz.subscription_url}'
    )

    return text


user_buy_text = '''
💳 <b>Оплата ЖКХ</b>

📦 <b>Подписка на 1 месяц</b> 
    • Безлимитный трафик
    • Высокая скорость
    • Доступ ко всем серверам
    • До 10 подключений/устройств

⚠️ <i>ЖИЛИЩНЫЙ КАНАЛ ХОСТИНГА</i>
'''

payment_method_text = (
    '<b>Выберите способ оплаты</b>\n\n'
    '💳 <b>Картой РФ</b> – оплата через ЮKassa\n'
    '⭐️ <b>Звездами</b> – оплата через Telegram Stars'
)
